libxmlbus/data/wsaddr-testset/documents/echo/soap12/duplicateMessageIDRequest.xml

<?xml version="1.0"?>
<!-- $Id: duplicateMessageIDRequest.xml,v 1.5 2006/02/20 16:01:17 pdowney Exp $ -->
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap12:Header>
    <wsa:To>http://example.org/node/A</wsa:To>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:MessageID>http://message.id/test</wsa:MessageID>
    <wsa:MessageID>http://message.id/test</wsa:MessageID>
  </soap12:Header>
  <soap12:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </soap12:Body>
</soap12:Envelope>
